var q6_data = [
    {
        "id": "DIS-001",
        "type": "اختيار من متعدد",
        "subject": "الكوارث الطبيعية",
        "text": "شهدت تسعينات القرن ............. ظهور علم دراسة الكوارث كفرع جديد من فروع العلم.",
        "options": [
            "أ. العشرين",
            "ب. التاسع عشر",
            "ج. العاشر",
            "د. الخامس عشر"
        ],
        "answer": "أ. العشرين"
    },
    {
        "id": "DIS-002",
        "type": "اختيار من متعدد",
        "subject": "الكوارث الطبيعية",
        "text": "كان الهدف الرئيسي من علم دراسة الكوارث الطبيعية هو ..............",
        "options": [
            "أ. محاولة التنبؤ بحدوث الكوارث",
            "ب. محاولة وضع أساليب لمواجهة الكوارث",
            "ج. محاولة خفض الخسائر الناجمة عن حدوث الكارثة",
            "د. جميع ما سبق"
        ],
        "answer": "د. جميع ما سبق"
    },
    {
        "id": "DIS-003",
        "type": "اختيار من متعدد",
        "subject": "الكوارث الطبيعية",
        "text": "بحسب رؤية الباحثين، فإن آثار الحروب والتلوث البيئي هي ......... بينما الزلازل والبراكين فهي .......... مُسببة لحدوث الكوارث الطبيعية.",
        "options": [
            "أ. عوامل طبيعية، عوامل من صنع الإنسان",
            "ب. عوامل من صنع الإنسان، عوامل طبيعية",
            "ج. عوامل مشتركة، عوامل طبيعية",
            "د. عوامل من صنع الإنسان، عوامل مشتركة"
        ],
        "answer": "ب. عوامل من صنع الإنسان، عوامل طبيعية"
    },
    {
        "id": "DIS-004",
        "type": "اختيار من متعدد",
        "subject": "الكوارث الطبيعية",
        "text": "يمكن تصنيف الزلازل كونها أحد الظواهر الطبيعية طبقاً لطبيعة الحدث بأنها كوارث ................... بينما يُعد انتشار الأمراض والأوبئة كوارث ............",
        "options": [
            "أ. ميترولوجية، بيولوجية",
            "ب. جيومرفولوجية، بيولوجية",
            "ج. جيولوجية، بيولوجية",
            "د. جيومرفولوجية، ميترولوجية"
        ],
        "answer": "ج. جيولوجية، بيولوجية"
    },
    {
        "id": "DIS-005",
        "type": "اختيار من متعدد",
        "subject": "الكوارث الطبيعية",
        "text": "يتم إنفاق حوالي ......... من إجمالي الخسائر الاقتصادية الناتجة عن الكوارث الطبيعية على عمليات التوقعات والحماية، ومحاولات منع وقوع الكوارث أو تخفيف الآثار الناجمة عنها.",
        "options": [
            "أ. 55%",
            "ب. 70%",
            "ج. 10%",
            "د. 30%"
        ],
        "answer": "د. 30%"
    },
    {
        "id": "DIS-006",
        "type": "اختيار من متعدد",
        "subject": "الكوارث الطبيعية",
        "text": "يرجح العلماء أن سبب زيادة عدد ضحايا الكوارث الطبيعية في قارة آسيا مقارنةً بقارة إفريقيا هو ............",
        "options": [
            "أ. طبيعة الكوارث التي تتعرض لها كل منطقة",
            "ب. زيادة الكثافة السكانية في قارة آسيا",
            "ج. مناطق تركُّز الكوارث الطبيعية بكلا القارتين",
            "د. جميع ما سبق"
        ],
        "answer": "د. جميع ما سبق"
    },
    {
        "id": "DIS-007",
        "type": "اختيار من متعدد",
        "subject": "الكوارث الطبيعية",
        "text": "تُعَدُّ منطقة ........... أكثر المناطق على سطح الأرض تأثيراً بالزلازل.",
        "options": [
            "أ. البؤرة الزلزالية",
            "ب. مركز الزلزال",
            "ج. محيط الزلزال",
            "د. المركز الجوفي للزلزال"
        ],
        "answer": "ب. مركز الزلزال"
    },
    {
        "id": "DIS-008",
        "type": "اختيار من متعدد",
        "subject": "الكوارث الطبيعية",
        "text": "في ظل التقدم المعرفي والتقني حتى اليوم فإن الهدف الرئيسي من وسائل وأجهزة لرصد وقياس شدة الزلازل كل الآتي عدا ...........",
        "options": [
            "أ. رصد ودراسة شدَّة الزلازل",
            "ب. رصد أماكن وقوعها بعد حدوثها",
            "ج. التنبؤ بحدوثها قبل وقوعها",
            "د. دراسة أعماق بُؤر ومراكز الزلازل"
        ],
        "answer": "ج. التنبؤ بحدوثها قبل وقوعها"
    },
    {
        "id": "DIS-009",
        "type": "اختيار من متعدد",
        "subject": "الكوارث الطبيعية",
        "text": "تكوّن الكرة الأرضية عدد من الأغلفة جميعها صلبة وشبه صلبة عدا .................",
        "options": [
            "أ. الوشاح العلوي",
            "ب. الوشاح السفلي",
            "ج. اللب الخارجي",
            "د. اللب الداخلي"
        ],
        "answer": "ج. اللب الخارجي"
    },
    {
        "id": "DIS-010",
        "type": "اختيار من متعدد",
        "subject": "الكوارث الطبيعية",
        "text": "تخترق الموجات الزلزالية المستعرضة (S-waves) جميع أغلفة الأرض عدا .................",
        "options": [
            "أ. القشرة",
            "ب. الوشاح العلوي",
            "ج. الوشاح السفلي",
            "د. اللب الخارجي"
        ],
        "answer": "د. اللب الخارجي"
    },
    {
        "id": "DIS-011",
        "type": "اختيار من متعدد",
        "subject": "الكوارث الطبيعية",
        "text": "يرجع الأثر التدميري للمباني والبنية التحتية الذي نشاهده للزلازل إلى شدة الموجات .................",
        "options": [
            "أ. السطحية",
            "ب. الأولية التضاغطية",
            "ج. الثانوية المستعرضة",
            "د. الموجات الداخلية"
        ],
        "answer": "أ. السطحية"
    },
    {
        "id": "DIS-012",
        "type": "اختيار من متعدد",
        "subject": "الكوارث الطبيعية",
        "text": "يُعد زلزال غوجارات أحد أكبر الكوارث الطبيعية التي أصابت غرب الهند الذي تأثرت به الهند وباكستان عام ........................",
        "options": [
            "أ. 2011",
            "ب. 2021",
            "ج. 2010",
            "د. 2001"
        ],
        "answer": "د. 2001"
    },
    {
        "id": "DIS-013",
        "type": "اختيار من متعدد",
        "subject": "الكوارث الطبيعية",
        "text": "يُمثِّل الشكل أحد قراءات جهاز السيالموجراف والمُوضَّح عليها الزمن بالدقيقة وسعة الزلزال المرصودة بالملي متر.\n<img src=\"data/q13.png\" alt=\"q13\" style=\"max-width:100%; border-radius:8px; margin:10px 0;\" />\nيمثل الرمز (A) .....................",
        "options": [
            "أ. الموجات السطحية (Surface Waves)",
            "ب. الموجات الداخلية (Body Waves)",
            "ج. الموجات الأولية التضاغطية (P-waves)",
            "د. الموجات الثانوية المستعرضة (S-waves)"
        ],
        "answer": "ج. الموجات الأولية التضاغطية (P-waves)"
    },
    {
        "id": "DIS-014",
        "type": "اختيار من متعدد",
        "subject": "الكوارث الطبيعية",
        "text": "يُمثِّل الشكل أحد قراءات جهاز السيالموجراف والمُوضَّح عليها الزمن بالدقيقة وسعة الزلزال المرصودة بالملي متر.\n<img src=\"data/q13.png\" alt=\"q13\" style=\"max-width:100%; border-radius:8px; margin:10px 0;\" />\nيمثل الرمز (B) .....................",
        "options": [
            "أ. الموجات السطحية (Surface Waves)",
            "ب. الموجات الداخلية (Body Waves)",
            "ج. الموجات الأولية التضاغطية (P-waves)",
            "د. الموجات الثانوية المستعرضة (S-waves)"
        ],
        "answer": "د. الموجات الثانوية المستعرضة (S-waves)"
    },
    {
        "id": "DIS-015",
        "type": "اختيار من متعدد",
        "subject": "الكوارث الطبيعية",
        "text": "يُمثِّل الشكل أحد قراءات جهاز السيالموجراف والمُوضَّح عليها الزمن بالدقيقة وسعة الزلزال المرصودة بالملي متر.\n<img src=\"data/q13.png\" alt=\"q13\" style=\"max-width:100%; border-radius:8px; margin:10px 0;\" />\nيمثل الرمز (C) .....................",
        "options": [
            "أ. الموجات السطحية (Surface Waves)",
            "ب. الموجات الداخلية (Body Waves)",
            "ج. الموجات الأولية التضاغطية (P-waves)",
            "د. الموجات الثانوية المستعرضة (S-waves)"
        ],
        "answer": "أ. الموجات السطحية (Surface Waves)"
    },
    {
        "id": "DIS-016",
        "type": "اختيار من متعدد",
        "subject": "الكوارث الطبيعية",
        "text": "يُمثِّل الشكل أحد قراءات جهاز السيالموجراف والمُوضَّح عليها الزمن بالدقيقة وسعة الزلزال المرصودة بالملي متر.\n<img src=\"data/q13.png\" alt=\"q13\" style=\"max-width:100%; border-radius:8px; margin:10px 0;\" />\nالفاصل الزمني بين الموجات الأولية والثانوية عبارة عن ..................",
        "options": [
            "أ. 40 دقيقة",
            "ب. 35 ثانية",
            "ج. 3.5 دقيقة",
            "د. 3.5 ثانية"
        ],
        "answer": "ج. 3.5 دقيقة"
    },
    {
        "id": "DIS-017",
        "type": "اختيار من متعدد",
        "subject": "الكوارث الطبيعية",
        "text": "تنشأ موجات المد البحري (التسونامي) نتيجة للهزات الأرضية المصاحبة للانكسارات الأرضية لقاع المحيطات وتتراوح سرعتها بين ........................",
        "options": [
            "أ. 500 – 950 كم/ساعة",
            "ب. 1500 – 2500 كم/ساعة",
            "ج. 15 – 120 كم/ساعة",
            "د. 500 – 700 متر/ساعة"
        ],
        "answer": "أ. 500 – 950 كم/ساعة"
    },
    {
        "id": "DIS-018",
        "type": "اختيار من متعدد",
        "subject": "الكوارث الطبيعية",
        "text": "أدى تصدُّع على طول الفالق بين .................... و ....................... نهاية عام 2004 إلى زلزال سومطرة قبالة الساحل الغربي لشمال إندونيسيا والذي نتج عنه موجات التسونامي التي أدت لمقتل حوالي ربع مليون شخصاً.",
        "options": [
            "أ. الصفيحة الهندية والصفيحة الإفريقية",
            "ب. صفيحة بورما والصفيحة الهندية",
            "ج. صفيحة الفلبين والصفيحة الهندية",
            "د. صفيحة بورما والصفيحة الفلبينية"
        ],
        "answer": "ب. صفيحة بورما والصفيحة الهندية"
    },
    {
        "id": "DIS-019",
        "type": "اختيار من متعدد",
        "subject": "الكوارث الطبيعية",
        "text": "الفيضانات ................ هي أحد أنواع الفيضانات والتي ترتبط بمعدل هطول الأمطار بمناطق منابع الأنهار وعادةً ما تكون على نطاقات واسعة.",
        "options": [
            "أ. البحرية",
            "ب. النهرية",
            "ج. السيلية",
            "د. الساحلية"
        ],
        "answer": "ج. السيلية"
    },
    {
        "id": "DIS-020",
        "type": "اختيار من متعدد",
        "subject": "الكوارث الطبيعية",
        "text": "يرجع السبب الرئيسي لأخطار الفيضانات السيلية على السكان هو ............ وهو الأمر الذي يبعث بالأمان للسكان وعدم الاستعداد لمخاطرها.",
        "options": [
            "أ. طول الفاصل الزمني بين الفيضانات",
            "ب. قلة كمية المياه في الفيضانات",
            "ج. حدوثها في مناطق نائية وبعيدة عن المجتمعات",
            "د. امتدادها على نطاقات صغيرة جداً"
        ],
        "answer": "أ. طول الفاصل الزمني بين الفيضانات"
    },
    {
        "id": "DIS-021",
        "type": "اختيار من متعدد",
        "subject": "الكوارث الطبيعية",
        "text": "من أخطر السيول التي تعرض لها محافظة البحر الأحمر بوادي العمبجي عام ............",
        "options": [
            "أ. 1988",
            "ب. 1950",
            "ج. 1920",
            "د. 1977"
        ],
        "answer": "د. 1977"
    },
    {
        "id": "DIS-022",
        "type": "اختيار من متعدد",
        "subject": "الكوارث الطبيعية",
        "text": "من أحد أكثر الأماكن السياحية في مصر المُعرَّضة لأخطار السيول هي مدينة ..................... نتيجة وقوعها في نهاية وادي عربة.",
        "options": [
            "أ. القُصير",
            "ب. العين السخنة",
            "ج. مرسى علم",
            "د. مرسى مطروح"
        ],
        "answer": "ب. العين السخنة"
    },
    {
        "id": "DIS-023",
        "type": "اختيار من متعدد",
        "subject": "الكوارث الطبيعية",
        "text": "في إطار سعي الإنسان لمواجهة أخطار الفيضانات والسيول فإنه يجب .....................",
        "options": [
            "أ. إنشاء السدود والخزانات على الروافد الرئيسية",
            "ب. تعميق القنوات المائية للأنهار",
            "ج. تنظيم عمليات البناء على جوانب الأنهار",
            "د. جميع ما سبق"
        ],
        "answer": "د. جميع ما سبق"
    },
    {
        "id": "DIS-024",
        "type": "اختيار من متعدد",
        "subject": "الكوارث الطبيعية",
        "text": "من أمثلة المناطق التي تتعرض للهبوط الأرضي في جمهورية مصر العربية مدينة مرسى مطروح بسبب حدوث عملية إذابة تحتية كيميائية في صخور .............. الذي تم بناء مساكن هذه المدينة فوقه.",
        "options": [
            "أ. الحجر الجيري",
            "ب. الحجر الرملي",
            "ج. الحجر الطيني",
            "د. جميع ما سبق"
        ],
        "answer": "أ. الحجر الجيري"
    },
    {
        "id": "DIS-025",
        "type": "اختيار من متعدد",
        "subject": "الكوارث الطبيعية",
        "text": "من أكثر المناطق المُعرَّضة لأخطار تآكل الشواطئ في الدلتا كل ما يلي عدا ..............",
        "options": [
            "أ. منطقة مصب فرع رشيد",
            "ب. منطقة ساحل العقبة",
            "ج. منطقة بلطيم شرق فتحة البرلس",
            "د. منطقة رأس البر"
        ],
        "answer": "ب. منطقة ساحل العقبة"
    },
    {
        "id": "DIS-026",
        "type": "اختيار من متعدد",
        "subject": "الكوارث الطبيعية",
        "text": "جميع ما يلي هي وسائل لحماية الشواطئ من التآكل عدا ................",
        "options": [
            "أ. مثبتات الصخور بالساحل",
            "ب. الحوائط البحرية",
            "ج. كاسرات الأمواج",
            "د. الرصائف البحرية"
        ],
        "answer": "أ. مثبتات الصخور بالساحل"
    },
    {
        "id": "DIS-027",
        "type": "اختيار من متعدد",
        "subject": "الكوارث الطبيعية",
        "text": "................ عبارة عن بناءات مُشيَّدة في موازاة خط الشاطئ وعلى مسافة منه، وتهدف إلى تسطُّح الأمواج وامتصاص جزء كبير من طاقتها.",
        "options": [
            "أ. الحوائط البحرية",
            "ب. الرصائف البحرية",
            "ج. كاسرات الأمواج",
            "د. لا يوجد إجابة صحيحة"
        ],
        "answer": "ج. كاسرات الأمواج"
    },
    {
        "id": "DIS-028",
        "type": "اختيار من متعدد",
        "subject": "الكوارث الطبيعية",
        "text": "تنشأ ................ فوق المسطحات المائية الواسعة المصحوبة برياح دافئة ورطبة وتتكون من كتلة من الهواء والسحب التي تتحرك حركة دائرية من نقطة مركزية والتي تتحرك عادةً في اتجاه من الشرق للغرب.",
        "options": [
            "أ. العواصف الترابية",
            "ب. العواصف الرملية",
            "ج. الأعاصير القمعية",
            "د. الأعاصير المدارية"
        ],
        "answer": "د. الأعاصير المدارية"
    },
    {
        "id": "DIS-029",
        "type": "صح/خطأ",
        "subject": "الكوارث الطبيعية",
        "text": "وفقاً لسرعة تأثير الكوارث الطبيعية فإن الزلازل والانهيارات الأرضية تُعد من الكوارث بطيئة التأثير.",
        "options": null,
        "answer": "خطأ"
    },
    {
        "id": "DIS-030",
        "type": "صح/خطأ",
        "subject": "الكوارث الطبيعية",
        "text": "حسب تعريف المنظمة الدولية للحماية المدنية فإن الكارثة الطبيعية هي حوادث متوقعة ناجمة عن قوى الطبيعة ويترتب عليها خسائر في الأرواح وتدمير في الممتلكات، وتكون ذات تأثير شديد على الاقتصاد الوطني.",
        "options": null,
        "answer": "خطأ"
    },
    {
        "id": "DIS-031",
        "type": "صح/خطأ",
        "subject": "الكوارث الطبيعية",
        "text": "وحسب الدراسات المُقدَّمة عن قارة إفريقيا خلال الفترة من عام 1947 حتى عام 1980 فقد تجاوز عدد ضحايا الكوارث الطبيعية المليون نسمة.",
        "options": null,
        "answer": "خطأ"
    },
    {
        "id": "DIS-032",
        "type": "صح/خطأ",
        "subject": "الكوارث الطبيعية",
        "text": "أثناء حدوث الزلزال فإن أكثر المناطق تضرراً هي الواقعة ضمن المركز السطحي للزلزال.",
        "options": null,
        "answer": "صح"
    },
    {
        "id": "DIS-033",
        "type": "صح/خطأ",
        "subject": "الكوارث الطبيعية",
        "text": "بفضل منظومة مُعقَّدة من أجهزة الرصد والأقمار الصناعية استطاع العلماء في بداية القرن الحالي التنبؤ بزمن وقوع الزلازل للحد من آثارها عن طريق تنبيه الناس لمغادرة تلك المناطق.",
        "options": null,
        "answer": "خطأ"
    },
    {
        "id": "DIS-034",
        "type": "صح/خطأ",
        "subject": "الكوارث الطبيعية",
        "text": "تُعد مصر من الدول الرائدة في الاستعداد للكوارث الطبيعية حيث تم إنشاء أول مرصد لقياس ورصد الزلازل في مصر منذ عام 1999.",
        "options": null,
        "answer": "خطأ"
    },
    {
        "id": "DIS-035",
        "type": "صح/خطأ",
        "subject": "الكوارث الطبيعية",
        "text": "يعتبر مقياس العالم الزلزالي \"Earthquake Magnitude scale\" أحد أهم الأجهزة لتحديد مركز وبؤرة الزلزال.",
        "options": null,
        "answer": "خطأ"
    },
    {
        "id": "DIS-036",
        "type": "صح/خطأ",
        "subject": "الكوارث الطبيعية",
        "text": "عادةً ما تكون الفيضانات سيلية على نطاقات واسعة إذا ما قُورنت بالفيضانات النهرية وقد يمتد أثرها لعدة دول.",
        "options": null,
        "answer": "خطأ"
    },
    {
        "id": "DIS-037",
        "type": "صح/خطأ",
        "subject": "الكوارث الطبيعية",
        "text": "تعتبر الزلازل أحد أخطر الكوارث الطبيعية التي تهدد الإنسان نتيجة نقل المواد الصخرية فوق السفوح والذي يختلف في طبيعته من حيث الحجم والسرعة ونوع التكوينات الصخرية المنقولة والأخطار التي تنجم عن حدوثها.",
        "options": null,
        "answer": "خطأ"
    },
    {
        "id": "DIS-038",
        "type": "صح/خطأ",
        "subject": "الكوارث الطبيعية",
        "text": "ساعد بناء السد العالي في عملية حماية شاطئ الدلتا من التآكل عن طريق منع وصول الطمي للساحل.",
        "options": null,
        "answer": "خطأ"
    },
    {
        "id": "DIS-039",
        "type": "صح/خطأ",
        "subject": "الكوارث الطبيعية",
        "text": "عادةً ما يكون المطر غزيراً في المناطق التي تتعرض للعواصف المدارية باستثناء مركز العاصفة الذي دائماً ما يكون جافاً.",
        "options": null,
        "answer": "صح"
    }
];
