const tf1_data = [
    {
        "id": "EGY-001",
        "type": "صح/خطأ",
        "subject": "السكان في مصر",
        "text": "بلغ عدد سكان مصر ١٠٠ مليون نسمه تقريب عام ٢٠٢٠.",
        "options": null,
        "answer": "خطأ"
    },
    {
        "id": "EGY-002",
        "type": "صح/خطأ",
        "subject": "السكان في مصر",
        "text": "من العادات الاجتماعية خاصه فى الريف تفضيل الذكر المولود مما يدعو إلى تكرار الحمل والولادة على أمل ميلاد الذكر.",
        "options": null,
        "answer": "صح"
    },
    {
        "id": "EGY-003",
        "type": "صح/خطأ",
        "subject": "السكان في مصر",
        "text": "مشكلة مصر السكانية وأغلب الدول النامية لها ثلاث أبعاد: النمو السريع للسكان، سوء التوزيع الجغرافي للسكان، ثم انخفاض خصائص السكان التعليمية والصحية والعمرية والفقر.",
        "options": null,
        "answer": "صح"
    },
    {
        "id": "EGY-004",
        "type": "صح/خطأ",
        "subject": "السكان في مصر",
        "text": "حصه مصر من مياه النيل سنويا تبلغ ١٠٠ مليار متر مكعب.",
        "options": null,
        "answer": "خطأ"
    },
    {
        "id": "EGY-005",
        "type": "صح/خطأ",
        "subject": "السكان في مصر",
        "text": "الزواج المبكر والإنجاب المبكر للإناث خاصه فى الريف لا يساعد على الزيادة السكانية.",
        "options": null,
        "answer": "خطأ"
    },
    {
        "id": "EGY-006",
        "type": "صح/خطأ",
        "subject": "السكان في مصر",
        "text": "الزيادة السكانية فى مصر ترجع فى الأساس إلى زياده عدد المواليد وتناقص عدد الوفيات.",
        "options": null,
        "answer": "صح"
    },
    {
        "id": "EGY-007",
        "type": "صح/خطأ",
        "subject": "السكان في مصر",
        "text": "من المتوقع أن يصل عدد سكان مصر إلى ١٤٠ مليون نسمه عام ٢٠٥٠.",
        "options": null,
        "answer": "صح"
    },
    {
        "id": "EGY-008",
        "type": "صح/خطأ",
        "subject": "السكان في مصر",
        "text": "عدم الفهم الصحيح للدين يجعل البعض خاصه فى الريف ينظر إلى تنظيم الأسرة بعين الريب والحرماني.",
        "options": null,
        "answer": "صح"
    },
    {
        "id": "EGY-009",
        "type": "صح/خطأ",
        "subject": "السكان في مصر",
        "text": "تحتل مصر المرتبة السادسة عشر بين دول العالم من حيث عدد السكان.",
        "options": null,
        "answer": "صح"
    },
    {
        "id": "EGY-010",
        "type": "صح/خطأ",
        "subject": "السكان في مصر",
        "text": "بينما توضح الدراسات إن الحد الأدنى لنصيب الفرد من المياه يجب ألا يقل عن ١٠٠٠ متر مكعب إلا إن نصيب الفرد من المياه فى مصر لا يزيد عن٦٠٠ متر مكعب مما يجعل مصر من دول الفقر المائي.",
        "options": null,
        "answer": "صح"
    },
    {
        "id": "EGY-011",
        "type": "صح/خطأ",
        "subject": "السكان في مصر",
        "text": "الزيادة السكانية = عدد المواليد + عدد الوفيات – المهاجرين.",
        "options": null,
        "answer": "خطأ"
    },
    {
        "id": "EGY-012",
        "type": "صح/خطأ",
        "subject": "السكان في مصر",
        "text": "تحتل مصر المرتب الاولى عربيا من حيث عدد السكان.",
        "options": null,
        "answer": "صح"
    },
    {
        "id": "EGY-013",
        "type": "صح/خطأ",
        "subject": "السكان في مصر",
        "text": "لمواجهه الزيادة السكانية وتداعياتها يجب ان تعمل الحكومة على محورين أساسيين فى نفس الوقت: المحور الاول وضع سياسات واستراتيجيات سكانيه للتحكم فى النمو السكاني، والمحور الثاني وضع سياسات واستراتيجيات تنموية لاستيعاب ومقابله احتياجات الزيادة السكانية المستمرة.",
        "options": null,
        "answer": "صح"
    },
    {
        "id": "EGY-014",
        "type": "صح/خطأ",
        "subject": "السكان في مصر",
        "text": "تناول دستور مصر ٢٠١٧ الزيادة السكانية حيث يطالب الحكومة بوضع خطط وبرامج سكانيه تهدف إلى تحقيق التوازن بين معدلات النمو السكاني والموارد الاقتصادية المتاحة.",
        "options": null,
        "answer": "صح"
    },
    {
        "id": "EGY-015",
        "type": "صح/خطأ",
        "subject": "السكان في مصر",
        "text": "نسبه سكان المناطق الريفية تبلغ ٧٠ ٪ من إجمالي سكان مصر.",
        "options": null,
        "answer": "خطأ"
    },
    {
        "id": "EGY-016",
        "type": "صح/خطأ",
        "subject": "السكان في مصر",
        "text": "التعداد العام للسكان والذى تجريه الدولة كل ١٠ سنوات هو المصدر الأساسي للتعرف على عدد سكان الدولة.",
        "options": null,
        "answer": "صح"
    },
    {
        "id": "EGY-017",
        "type": "صح/خطأ",
        "subject": "السكان في مصر",
        "text": "للجمعيات الأهلية والقطاع الخاص دور فى الاستراتيجيات السكانية وتنفيذها.",
        "options": null,
        "answer": "صح"
    },
    {
        "id": "EGY-018",
        "type": "صح/خطأ",
        "subject": "السكان في مصر",
        "text": "تعتبر محافظه الإسكندرية اكبر محافظه مصريه من حيث عدد السكان.",
        "options": null,
        "answer": "خطأ"
    },
    {
        "id": "EGY-019",
        "type": "صح/خطأ",
        "subject": "السكان في مصر",
        "text": "بالرغم من إن مساحه مصر الكلية حوالى مليون كيلو متر مربع إلا أن المساحة المأهولة بالسكان لا تزيد عن ٧٪ تقريبا.",
        "options": null,
        "answer": "صح"
    },
    {
        "id": "EGY-020",
        "type": "صح/خطأ",
        "subject": "السكان في مصر",
        "text": "سكان كل من محافظه القاهرة ومحافظه الجيزه ومحافظه القليوبيه يمثلون ١٠٪ من سكان الجمهورية فقط البالغ حجمه ١٠٠ مليون نسمه.",
        "options": null,
        "answer": "خطأ"
    },
    {
        "id": "EGY-021",
        "type": "صح/خطأ",
        "subject": "السكان في مصر",
        "text": "هناك فجوه غذائية تجعل مصر تستورد ٨٠٪ من احتياجاتها الغذائية.",
        "options": null,
        "answer": "صح"
    },
    {
        "id": "EGY-022",
        "type": "صح/خطأ",
        "subject": "السكان في مصر",
        "text": "مصر تعتبر واحده من أكبر ٣ دول استيرادا للقمح.",
        "options": null,
        "answer": "صح"
    },
    {
        "id": "EGY-023",
        "type": "صح/خطأ",
        "subject": "السكان في مصر",
        "text": "الفقر أحد الاسباب الهامه لزياده الطلب على الإنجاب حتى يستطيع الأبناء مساعدة العائلة عند الكبر فى السن.",
        "options": null,
        "answer": "صح"
    },
    {
        "id": "EGY-024",
        "type": "صح/خطأ",
        "subject": "السكان في مصر",
        "text": "البطالة لا تعتبر من تداعيات وآثار الزيادة السكانية.",
        "options": null,
        "answer": "خطأ"
    },
    {
        "id": "EGY-025",
        "type": "صح/خطأ",
        "subject": "السكان في مصر",
        "text": "معدل المواليد هو عدد المواليد لكل ١٠٠٠ من السكان.",
        "options": null,
        "answer": "صح"
    },
    {
        "id": "EGY-026",
        "type": "صح/خطأ",
        "subject": "السكان في مصر",
        "text": "الأميه تعتبر أحد تداعيات الزيادة السكاني.",
        "options": null,
        "answer": "صح"
    },
    {
        "id": "EGY-027",
        "type": "صح/خطأ",
        "subject": "السكان في مصر",
        "text": "مصر أكبر دوله افريقيا من حيث عدد السكان.",
        "options": null,
        "answer": "خطأ"
    },
    {
        "id": "EGY-028",
        "type": "صح/خطأ",
        "subject": "السكان في مصر",
        "text": "محدودية المياه تعنى محدودية الأمن الغذائي.",
        "options": null,
        "answer": "صح"
    },
    {
        "id": "EGY-029",
        "type": "صح/خطأ",
        "subject": "السكان في مصر",
        "text": "الزيادة الطبيعية للسكان هو الفرق بين عدد المواليد وعدد الوفيات لكل ١٠٠٠ من السكان.",
        "options": null,
        "answer": "صح"
    },
    {
        "id": "EGY-030",
        "type": "صح/خطأ",
        "subject": "السكان في مصر",
        "text": "التيار المتحفظ فى المجتمع يشجع على زياده الإنجاب.",
        "options": null,
        "answer": "صح"
    },
    {
        "id": "EGY-031",
        "type": "صح/خطأ",
        "subject": "السكان في مصر",
        "text": "المشكلة السكانية فى مصر أصبحت مشكله أمن قومي.",
        "options": null,
        "answer": "صح"
    },
    {
        "id": "EGY-032",
        "type": "صح/خطأ",
        "subject": "السكان في مصر",
        "text": "العادات والتقاليد فى المجتمع ومنها النظرة إلى أن زياده الإنجاب تعتبر صمام أمان للمرأة – خاصه فى الريف – يجنبها خطر الطلاق أو الزواج بأخري.",
        "options": null,
        "answer": "صح"
    },
    {
        "id": "EGY-033",
        "type": "صح/خطأ",
        "subject": "السكان في مصر",
        "text": "توضح الدراسات والبحوث إنه لا يوجد ارتباط بين زياده الإنجاب والأميه.",
        "options": null,
        "answer": "خطأ"
    },
    {
        "id": "EGY-034",
        "type": "صح/خطأ",
        "subject": "السكان في مصر",
        "text": "نسبه الإناث فى المجتمع أعلى من نسبه الذكور.",
        "options": null,
        "answer": "خطأ"
    },
    {
        "id": "EGY-035",
        "type": "صح/خطأ",
        "subject": "السكان في مصر",
        "text": "سكان مصر يزيدون بمقدار ٢ مليون نسمه سنويا.",
        "options": null,
        "answer": "صح"
    },
    {
        "id": "EGY-036",
        "type": "صح/خطأ",
        "subject": "السكان في مصر",
        "text": "معدل وفيات الأطفال الرضع (أقل من سنه فى العمر) وعدد وفيات الاطفال الرضع لكل ١٠٠٠ من السكان يعتبر مقياس للحالة الصحية فى المجتمع.",
        "options": null,
        "answer": "صح"
    },
    {
        "id": "EGY-037",
        "type": "صح/خطأ",
        "subject": "السكان في مصر",
        "text": "نسبه الأطفال فى المجتمع (أقل من ١٥ سنه) تمثل ثلث حجم السكان.",
        "options": null,
        "answer": "صح"
    },
    {
        "id": "EGY-038",
        "type": "صح/خطأ",
        "subject": "السكان في مصر",
        "text": "ظاهره أطفال الشوارع وتزايدها لا علاقه لها بالنمو السكاني.",
        "options": null,
        "answer": "خطأ"
    },
    {
        "id": "EGY-039",
        "type": "صح/خطأ",
        "subject": "السكان في مصر",
        "text": "تلوث البيئة (بالإضافة إلى عوامل اخري) ترجع إلى النمو السكاني المتزايد.",
        "options": null,
        "answer": "صح"
    },
    {
        "id": "EGY-040",
        "type": "صح/خطأ",
        "subject": "السكان في مصر",
        "text": "الفقر والجوع والمرض من تداعيات الزيادة السكانية.",
        "options": null,
        "answer": "صح"
    },
    {
        "id": "EGY-041",
        "type": "صح/خطأ",
        "subject": "السكان في مصر",
        "text": "المناطق الريفية أقل إنجابا من المناطق الحضرية فى مصر طبقا لنتائج الدراسات والبحوث.",
        "options": null,
        "answer": "خطأ"
    },
    {
        "id": "EGY-042",
        "type": "صح/خطأ",
        "subject": "السكان في مصر",
        "text": "المشكلة السكانية تنشأ عندما تعجز الزيادة فى معدلات التنمية الاقتصادية والاجتماعية عن اللحاق بمعدلات الزيادة السكانية.",
        "options": null,
        "answer": "صح"
    },
    {
        "id": "EGY-043",
        "type": "صح/خطأ",
        "subject": "السكان في مصر",
        "text": "يمكن اعتبار زياده معدلات الجريمة أحد تبعات الزيادة السكانية.",
        "options": null,
        "answer": "صح"
    },
    {
        "id": "EGY-044",
        "type": "صح/خطأ",
        "subject": "السكان في مصر",
        "text": "للشباب دور هام فى مواجه مشكله التزايد السكاني خاصة إنهم آباء وأمهات الغد.",
        "options": null,
        "answer": "صح"
    },
    {
        "id": "EGY-045",
        "type": "صح/خطأ",
        "subject": "السكان في مصر",
        "text": "الدساتير المصرية تجاهلت المشكلة السكانية وخطورتها.",
        "options": null,
        "answer": "خطأ"
    },
    {
        "id": "EGY-046",
        "type": "صح/خطأ",
        "subject": "السكان في مصر",
        "text": "ازدحام الشوارع والمرور فى الشوارع يعتبر مظهر من مظاهر الزيادة السكانية.",
        "options": null,
        "answer": "صح"
    },
    {
        "id": "EGY-047",
        "type": "صح/خطأ",
        "subject": "السكان في مصر",
        "text": "البطالة وخاصه بطاله الشباب لا تعتبر من مظاهر ونتائج الزيادة السكانية.",
        "options": null,
        "answer": "خطأ"
    },
    {
        "id": "EGY-048",
        "type": "صح/خطأ",
        "subject": "السكان في مصر",
        "text": "على الحكومة أن تعمل على زياده الاستثمار فى المشروعات القومية الكبيرة وذلك لزيادة فرص العمل أمام الشباب.",
        "options": null,
        "answer": "صح"
    },
    {
        "id": "EGY-049",
        "type": "صح/خطأ",
        "subject": "السكان في مصر",
        "text": "لم يتأثر متوسط نصيب الفرد فى الأرض الزراعية رغم الزيادة السكانية المتتالية.",
        "options": null,
        "answer": "خطأ"
    },
    {
        "id": "EGY-050",
        "type": "صح/خطأ",
        "subject": "السكان في مصر",
        "text": "سوء أو الخلل فى التوزيع الجغرافي للسكان يعتبر البعد الأساسي للمشكلة السكانية فى مصر.",
        "options": null,
        "answer": "خطأ"
    }
];
