const tf2_data = [
    {
        "id": "HR-001",
        "type": "صح/خطأ",
        "subject": "حقوق الإنسان",
        "text": "لا يستطيع الإنسان أن يحيا حياة طبيعية وكريمة بدون حقوق تكفـل لـه آدميتـه، وتحقق له رغباته وحاجاته.",
        "options": null,
        "answer": "صح"
    },
    {
        "id": "HR-002",
        "type": "صح/خطأ",
        "subject": "حقوق الإنسان",
        "text": "حقوق الإنسان مقررة لكل شخص وغير ملازمة له.",
        "options": null,
        "answer": "خطأ"
    },
    {
        "id": "HR-003",
        "type": "صح/خطأ",
        "subject": "حقوق الإنسان",
        "text": "حقوق الإنسان هي: ضمانات قانونية عامة وعالمية تحمي كل إنسان دون تمييـز، بغض النظر عن جنسه، أو جنسيته، أو لغته، أو دينه، أو أصله العرقي.",
        "options": null,
        "answer": "صح"
    },
    {
        "id": "HR-004",
        "type": "صح/خطأ",
        "subject": "حقوق الإنسان",
        "text": "لا تحظى حقوق الإنسان باهتمام المنظمات الدولية.",
        "options": null,
        "answer": "خطأ"
    },
    {
        "id": "HR-005",
        "type": "صح/خطأ",
        "subject": "حقوق الإنسان",
        "text": "حقوق الإنسان هي حقوق عالميّة.",
        "options": null,
        "answer": "صح"
    },
    {
        "id": "HR-006",
        "type": "صح/خطأ",
        "subject": "حقوق الإنسان",
        "text": "حقوق الإنسان غير قابلة للتجزئة ومترابطة.",
        "options": null,
        "answer": "صح"
    },
    {
        "id": "HR-007",
        "type": "صح/خطأ",
        "subject": "حقوق الإنسان",
        "text": "يعتبر حق الشعوب في تقرير مصيرها من الحقوق الجماعية.",
        "options": null,
        "answer": "صح"
    },
    {
        "id": "HR-008",
        "type": "صح/خطأ",
        "subject": "حقوق الإنسان",
        "text": "حقوق الإنسان قابلة للتصرُّف فيها.",
        "options": null,
        "answer": "خطأ"
    },
    {
        "id": "HR-009",
        "type": "صح/خطأ",
        "subject": "حقوق الإنسان",
        "text": "لا يجوز تقييد حرية الشخص في حالة ارتكابه جريمة معاقب عليها.",
        "options": null,
        "answer": "خطأ"
    },
    {
        "id": "HR-010",
        "type": "صح/خطأ",
        "subject": "حقوق الإنسان",
        "text": "يعد الإعلان العالمي لحقوق الإنسان من أهم المواثيق الدولية التي تضمن وتحمـي حقوق الإنسان وحرياته.",
        "options": null,
        "answer": "صح"
    },
    {
        "id": "HR-011",
        "type": "صح/خطأ",
        "subject": "حقوق الإنسان",
        "text": "توجد سبع اتفاقيات دولية أساسية لحقوق الإنسان.",
        "options": null,
        "answer": "صح"
    },
    {
        "id": "HR-012",
        "type": "صح/خطأ",
        "subject": "حقوق الإنسان",
        "text": "صدر العهد الدولي الخاص بالحقوق المدنية والسياسية عام ١٩٩٩.",
        "options": null,
        "answer": "خطأ"
    },
    {
        "id": "HR-013",
        "type": "صح/خطأ",
        "subject": "حقوق الإنسان",
        "text": "قرينة البراءة تقضي بأن الشخص بريء ما لم تثبت إدانته.",
        "options": null,
        "answer": "صح"
    },
    {
        "id": "HR-014",
        "type": "صح/خطأ",
        "subject": "حقوق الإنسان",
        "text": "صدر العهد الدولي الخاص بالحقوق الاقتصادية والاجتماعية والثقافية عام ١٩٦٦.",
        "options": null,
        "answer": "صح"
    },
    {
        "id": "HR-015",
        "type": "صح/خطأ",
        "subject": "حقوق الإنسان",
        "text": "يجب القضاء على التمييز العنصري بكافة أشكاله وتعزيـز التفـاهم بـين جميـع الأجناس.",
        "options": null,
        "answer": "صح"
    },
    {
        "id": "HR-016",
        "type": "صح/خطأ",
        "subject": "حقوق الإنسان",
        "text": "تركز اتفاقية القضاء على أشكال التمييز ضد المرأة بشكل حصري علـى الحقـوق الخاصة بالطفل.",
        "options": null,
        "answer": "خطأ"
    },
    {
        "id": "HR-017",
        "type": "صح/خطأ",
        "subject": "حقوق الإنسان",
        "text": "تنص اتفاقية القضاء على أشكال التمييز ضد المرأة على عدم التمييز على أسـاس الجنس.",
        "options": null,
        "answer": "صح"
    },
    {
        "id": "HR-018",
        "type": "صح/خطأ",
        "subject": "حقوق الإنسان",
        "text": "تعتبر حقوق المرأة جزءاً لا يتجزأ من حقوق الإنسان العالمية ولا ينفصل عنها.",
        "options": null,
        "answer": "صح"
    },
    {
        "id": "HR-019",
        "type": "صح/خطأ",
        "subject": "حقوق الإنسان",
        "text": "يجوز تعرض المتهم للتعذيب في حالة ارتكابه إحدى الجنايات بالغة الخطورة.",
        "options": null,
        "answer": "خطأ"
    },
    {
        "id": "HR-020",
        "type": "صح/خطأ",
        "subject": "حقوق الإنسان",
        "text": "تعتبر حقوق الطفل من أهم حقوق الإنسان في منظومة الأمم المتحدة.",
        "options": null,
        "answer": "صح"
    },
    {
        "id": "HR-021",
        "type": "صح/خطأ",
        "subject": "حقوق الإنسان",
        "text": "للطفل حق في الاسم قبل ولادته.",
        "options": null,
        "answer": "خطأ"
    },
    {
        "id": "HR-022",
        "type": "صح/خطأ",
        "subject": "حقوق الإنسان",
        "text": "لا تتضمن اتفاقية حقوق الطفل حماية خاصة بأطفال الشوارع.",
        "options": null,
        "answer": "خطأ"
    },
    {
        "id": "HR-023",
        "type": "صح/خطأ",
        "subject": "حقوق الإنسان",
        "text": "تشجع الاتفاقية الدوليّة لحماية حقوق العمال المهاجرين غير الشرعية.",
        "options": null,
        "answer": "خطأ"
    },
    {
        "id": "HR-024",
        "type": "صح/خطأ",
        "subject": "حقوق الإنسان",
        "text": "ينص الدستور المصري على احترام حقوق الإنسان وحرياته.",
        "options": null,
        "answer": "صح"
    },
    {
        "id": "HR-025",
        "type": "صح/خطأ",
        "subject": "حقوق الإنسان",
        "text": "تتضمن القوانين الوطنية نصوصاً تحمي حقوق الإنسان بمختلف أنواعها.",
        "options": null,
        "answer": "صح"
    },
    {
        "id": "HR-026",
        "type": "صح/خطأ",
        "subject": "حقوق الإنسان",
        "text": "تعتبر اللوائح من المصادر الوطنية لحقوق الإنسان.",
        "options": null,
        "answer": "صح"
    },
    {
        "id": "HR-027",
        "type": "صح/خطأ",
        "subject": "حقوق الإنسان",
        "text": "تثبت الحقوق المدنية والسياسية للإنسان منذ ولادته، وتظل ملازمة له حتى موته.",
        "options": null,
        "answer": "صح"
    },
    {
        "id": "HR-028",
        "type": "صح/خطأ",
        "subject": "حقوق الإنسان",
        "text": "يعتبر حق الانتخاب من الحقوق السياسية.",
        "options": null,
        "answer": "صح"
    },
    {
        "id": "HR-029",
        "type": "صح/خطأ",
        "subject": "حقوق الإنسان",
        "text": "تعتبر الحقوق المدنية والسياسية من الحقوق المالية.",
        "options": null,
        "answer": "خطأ"
    },
    {
        "id": "HR-030",
        "type": "صح/خطأ",
        "subject": "حقوق الإنسان",
        "text": "يجوز التصرف في الحقوق المدنية والسياسية.",
        "options": null,
        "answer": "خطأ"
    },
    {
        "id": "HR-031",
        "type": "صح/خطأ",
        "subject": "حقوق الإنسان",
        "text": "حق الإنسان في الحياة هو من الحقوق الاقتصادية والاجتماعية والثقافية.",
        "options": null,
        "answer": "خطأ"
    },
    {
        "id": "HR-032",
        "type": "صح/خطأ",
        "subject": "حقوق الإنسان",
        "text": "حق الإنسان في الحياة هو حق طبيعي ثابت ملازم لكل إنسان.",
        "options": null,
        "answer": "صح"
    },
    {
        "id": "HR-033",
        "type": "صح/خطأ",
        "subject": "حقوق الإنسان",
        "text": "يجوز حرمان أي فرد من حياته بشكل تعسفي.",
        "options": null,
        "answer": "خطأ"
    },
    {
        "id": "HR-034",
        "type": "صح/خطأ",
        "subject": "حقوق الإنسان",
        "text": "يجوز تطبيق عقوبة الإعدام كجزاء على الجنايات بالغة الخطورة بدون حكم قضائي نهائي وبات.",
        "options": null,
        "answer": "خطأ"
    },
    {
        "id": "HR-035",
        "type": "صح/خطأ",
        "subject": "حقوق الإنسان",
        "text": "يجوز إجراء التجارب الطبية والعلمية على الفرد بدون رضاه الحر.",
        "options": null,
        "answer": "خطأ"
    },
    {
        "id": "HR-036",
        "type": "صح/خطأ",
        "subject": "حقوق الإنسان",
        "text": "لا يجوز التمييز بين البشر بسبب الجنس أو الدين أو اللون أو اللغة.",
        "options": null,
        "answer": "صح"
    },
    {
        "id": "HR-037",
        "type": "صح/خطأ",
        "subject": "حقوق الإنسان",
        "text": "للإنسان الحق في التنقل والإقامة والهجرة من مكان الى آخر دون أي قيود أو إجراءات.",
        "options": null,
        "answer": "خطأ"
    },
    {
        "id": "HR-038",
        "type": "صح/خطأ",
        "subject": "حقوق الإنسان",
        "text": "للمنازل حرمة، فلا يجوز دخولها، ولا تفتيشها، ولا مراقبتها أو التنصت عليها إلا بأمر قضائي مسبب.",
        "options": null,
        "answer": "صح"
    },
    {
        "id": "HR-039",
        "type": "صح/خطأ",
        "subject": "حقوق الإنسان",
        "text": "لكل إنسان ممارسة شعائر ديانته السماوية، بما لا يتعارض مع مقتضيات النظام العام والآداب.",
        "options": null,
        "answer": "صح"
    },
    {
        "id": "HR-040",
        "type": "صح/خطأ",
        "subject": "حقوق الإنسان",
        "text": "لكل إنسان حرية في التعبير عن آرائه وأفكاره بشرط عدم المساس بالنظام العام والآداب وحقوق الغير.",
        "options": null,
        "answer": "صح"
    },
    {
        "id": "HR-041",
        "type": "صح/خطأ",
        "subject": "حقوق الإنسان",
        "text": "يشترط لتأسيس الجمعيات والأحزاب السياسية إبلاغ الجهات المختصة للحصول على ترخيص منها.",
        "options": null,
        "answer": "صح"
    },
    {
        "id": "HR-042",
        "type": "صح/خطأ",
        "subject": "حقوق الإنسان",
        "text": "لا تتطلب الحقوق الاقتصادية والاجتماعية والثقافية تدخلاً إيجابياً من الدولة.",
        "options": null,
        "answer": "خطأ"
    },
    {
        "id": "HR-043",
        "type": "صح/خطأ",
        "subject": "حقوق الإنسان",
        "text": "لا يجوز فرض الحراسة على الملكية الخاصة إلا في الأحوال المبينة في القانون، وبحكم قضائي.",
        "options": null,
        "answer": "صح"
    },
    {
        "id": "HR-044",
        "type": "صح/خطأ",
        "subject": "حقوق الإنسان",
        "text": "يجيز القانون نزع الملكية الخاصة للمنفعة العامة إذا اقتضت ذلك المصلحة العامة.",
        "options": null,
        "answer": "صح"
    },
    {
        "id": "HR-045",
        "type": "صح/خطأ",
        "subject": "حقوق الإنسان",
        "text": "العمل حق، وواجب، وشرف تكفله الدولة.",
        "options": null,
        "answer": "صح"
    },
    {
        "id": "HR-046",
        "type": "صح/خطأ",
        "subject": "حقوق الإنسان",
        "text": "يجوز فصل العمال تعسفياً.",
        "options": null,
        "answer": "خطأ"
    },
    {
        "id": "HR-047",
        "type": "صح/خطأ",
        "subject": "حقوق الإنسان",
        "text": "للعامل الحق في التأمين الاجتماعي في حالات العجز عن العمل والشيخوخة والبطالة.",
        "options": null,
        "answer": "صح"
    },
    {
        "id": "HR-048",
        "type": "صح/خطأ",
        "subject": "حقوق الإنسان",
        "text": "لكل مواطن الحق في الرعاية الصحية المتكاملة وفقاً لمعايير الجودة.",
        "options": null,
        "answer": "صح"
    },
    {
        "id": "HR-049",
        "type": "صح/خطأ",
        "subject": "حقوق الإنسان",
        "text": "يعد الحق في التعليم من الحقوق الأساسية للإنسان.",
        "options": null,
        "answer": "صح"
    },
    {
        "id": "HR-050",
        "type": "صح/خطأ",
        "subject": "حقوق الإنسان",
        "text": "تحرص الدولة على إقامة المنشآت التعليمية وتوفير التعليم للمواطنين.",
        "options": null,
        "answer": "صح"
    }
];
