const tf3_data = [
    {
        "id": "COR-001",
        "type": "صح/خطأ",
        "subject": "الشفافية ومكافحة الفساد",
        "text": "يعتبر الفساد ظاهرة عالمية تتضخم وتنتشر لتهدد استقرار المجتمعات وأمنها.",
        "options": null,
        "answer": "صح"
    },
    {
        "id": "COR-002",
        "type": "صح/خطأ",
        "subject": "الشفافية ومكافحة الفساد",
        "text": "يتعذر كشف الفساد ومكافحته والسيطرة عليه دون إطار قانوني متكامل.",
        "options": null,
        "answer": "صح"
    },
    {
        "id": "COR-003",
        "type": "صح/خطأ",
        "subject": "الشفافية ومكافحة الفساد",
        "text": "تواجه مكافحة الفساد تحديات لم تكن مطروحة من قبل.",
        "options": null,
        "answer": "صح"
    },
    {
        "id": "COR-004",
        "type": "صح/خطأ",
        "subject": "الشفافية ومكافحة الفساد",
        "text": "الشفافية هي أداة مهمة للحد من الفساد ومكافحته.",
        "options": null,
        "answer": "صح"
    },
    {
        "id": "COR-005",
        "type": "صح/خطأ",
        "subject": "الشفافية ومكافحة الفساد",
        "text": "لا ترتبط الشفافية ارتباطًا وثيقًا بحقوق الإنسان الأساسية.",
        "options": null,
        "answer": "خطأ"
    },
    {
        "id": "COR-006",
        "type": "صح/خطأ",
        "subject": "الشفافية ومكافحة الفساد",
        "text": "يقصد بالشفافية: عدم الوضوح في اتخاذ القرارات.",
        "options": null,
        "answer": "خطأ"
    },
    {
        "id": "COR-007",
        "type": "صح/خطأ",
        "subject": "الشفافية ومكافحة الفساد",
        "text": "يجب تعزيز الشفافية بضمان تداول المعلومات المتعلقة بالفساد.",
        "options": null,
        "answer": "صح"
    },
    {
        "id": "COR-008",
        "type": "صح/خطأ",
        "subject": "الشفافية ومكافحة الفساد",
        "text": "لا يوجد فرق بين مفهومي الشفافية والنزاهة.",
        "options": null,
        "answer": "خطأ"
    },
    {
        "id": "COR-009",
        "type": "صح/خطأ",
        "subject": "الشفافية ومكافحة الفساد",
        "text": "وفقًا للمفهوم الواسع للفساد فإنه يقتصر فقط على العاملين بالدولة.",
        "options": null,
        "answer": "خطأ"
    },
    {
        "id": "COR-010",
        "type": "صح/خطأ",
        "subject": "الشفافية ومكافحة الفساد",
        "text": "يقوم القطاع الخاص بدور مهم في إفساد القطاع الحكومي.",
        "options": null,
        "answer": "صح"
    },
    {
        "id": "COR-011",
        "type": "صح/خطأ",
        "subject": "الشفافية ومكافحة الفساد",
        "text": "يتمثل الفساد المالي في الانحرافات المالية ومخالفة القواعد والأحكام التي تنظم سير العمل الإداري والمالي في الدولة.",
        "options": null,
        "answer": "صح"
    },
    {
        "id": "COR-012",
        "type": "صح/خطأ",
        "subject": "الشفافية ومكافحة الفساد",
        "text": "جرم المشرع المصري أهم أفعال الفساد ضمن إطار الجرائم المضـرة بالمصلحة العامة.",
        "options": null,
        "answer": "صح"
    },
    {
        "id": "COR-013",
        "type": "صح/خطأ",
        "subject": "الشفافية ومكافحة الفساد",
        "text": "تتطلب جريمة الرشوة وجود طرف واحد فقط هو المرتشي.",
        "options": null,
        "answer": "خطأ"
    },
    {
        "id": "COR-014",
        "type": "صح/خطأ",
        "subject": "الشفافية ومكافحة الفساد",
        "text": "اختلاس الأموال العامة هو عبث الموظف بما أُوتمن عليه من مال عام بحكم توليه الوظيفة العامة.",
        "options": null,
        "answer": "صح"
    },
    {
        "id": "COR-015",
        "type": "صح/خطأ",
        "subject": "الشفافية ومكافحة الفساد",
        "text": "يعاقب على جريمة اختلاس الأموال العامة بالحبس.",
        "options": null,
        "answer": "خطأ"
    },
    {
        "id": "COR-016",
        "type": "صح/خطأ",
        "subject": "الشفافية ومكافحة الفساد",
        "text": "لم تتضمن الاتفاقية الدولية لمكافحة الفساد أي نص بشأن اختلاس الأموال العامة.",
        "options": null,
        "answer": "خطأ"
    },
    {
        "id": "COR-017",
        "type": "صح/خطأ",
        "subject": "الشفافية ومكافحة الفساد",
        "text": "تضمن جريمة غسل الأموال للجاني الاستمرار في الاستفادة من تلك الأمـوال دون الخوف من المساءلة القانونية.",
        "options": null,
        "answer": "صح"
    },
    {
        "id": "COR-018",
        "type": "صح/خطأ",
        "subject": "الشفافية ومكافحة الفساد",
        "text": "لا تهدف جريمة غسل الأموال إلى إخفاء المصدر غير المشروع والمحظور لهـذه الأموال.",
        "options": null,
        "answer": "خطأ"
    },
    {
        "id": "COR-019",
        "type": "صح/خطأ",
        "subject": "الشفافية ومكافحة الفساد",
        "text": "الكسب غير المشروع: هو صورة من صور الفساد المالي.",
        "options": null,
        "answer": "صح"
    },
    {
        "id": "COR-020",
        "type": "صح/خطأ",
        "subject": "الشفافية ومكافحة الفساد",
        "text": "لا يؤدي الكسب غير المشروع إلى زيادة ممتلكات الجاني بشكل لا يتناسب مع دخله.",
        "options": null,
        "answer": "خطأ"
    },
    {
        "id": "COR-021",
        "type": "صح/خطأ",
        "subject": "الشفافية ومكافحة الفساد",
        "text": "لم تنص الاتفاقية الدولية لمكافحة الفساد على ضرورة مكافحة الثراء غير المشروع.",
        "options": null,
        "answer": "خطأ"
    },
    {
        "id": "COR-022",
        "type": "صح/خطأ",
        "subject": "الشفافية ومكافحة الفساد",
        "text": "يجب على الدول اتخاذ ما يلزم من تدابير تشريعية ودستورية لتجريم الإثراء غير المشروع.",
        "options": null,
        "answer": "صح"
    },
    {
        "id": "COR-023",
        "type": "صح/خطأ",
        "subject": "الشفافية ومكافحة الفساد",
        "text": "لا يرتبط الفساد الإداري بالوظائف العامة.",
        "options": null,
        "answer": "خطأ"
    },
    {
        "id": "COR-024",
        "type": "صح/خطأ",
        "subject": "الشفافية ومكافحة الفساد",
        "text": "يستبدل الفساد الإداري الكفاءة بالمحسوبية.",
        "options": null,
        "answer": "صح"
    },
    {
        "id": "COR-025",
        "type": "صح/خطأ",
        "subject": "الشفافية ومكافحة الفساد",
        "text": "استغلال النفوذ الوظيفي هو استفادة الموظف من وظيفته العامة للحصول على امتيازات خاصة.",
        "options": null,
        "answer": "صح"
    },
    {
        "id": "COR-026",
        "type": "صح/خطأ",
        "subject": "الشفافية ومكافحة الفساد",
        "text": "لا تعتبر المحسوبية والمحاباة والواسطة من صور الفساد الإداري.",
        "options": null,
        "answer": "خطأ"
    },
    {
        "id": "COR-027",
        "type": "صح/خطأ",
        "subject": "الشفافية ومكافحة الفساد",
        "text": "يكون الفساد سياسيًا عندما تكون دوافعه وأهدافه سياسية.",
        "options": null,
        "answer": "صح"
    },
    {
        "id": "COR-028",
        "type": "صح/خطأ",
        "subject": "الشفافية ومكافحة الفساد",
        "text": "تتعدد الأجهزة الرقابية الخاصة بمكافحة الفساد في مصر.",
        "options": null,
        "answer": "صح"
    },
    {
        "id": "COR-029",
        "type": "صح/خطأ",
        "subject": "الشفافية ومكافحة الفساد",
        "text": "تتطلب مكافحة الفساد اتخاذ تدابير وقائية.",
        "options": null,
        "answer": "صح"
    },
    {
        "id": "COR-030",
        "type": "صح/خطأ",
        "subject": "الشفافية ومكافحة الفساد",
        "text": "التدابير الوقائية لمكافحة الفساد ليست ذات طابع إجرائي مؤقت.",
        "options": null,
        "answer": "خطأ"
    },
    {
        "id": "COR-031",
        "type": "صح/خطأ",
        "subject": "الشفافية ومكافحة الفساد",
        "text": "يكتنف إجراءات استرداد الأموال المتحصلة من الفساد من دول أجنبية بعض الصعوبات.",
        "options": null,
        "answer": "صح"
    },
    {
        "id": "COR-032",
        "type": "صح/خطأ",
        "subject": "الشفافية ومكافحة الفساد",
        "text": "وردت الإجراءات الوقائية بشأن الفساد على سبيل الحصر.",
        "options": null,
        "answer": "خطأ"
    },
    {
        "id": "COR-033",
        "type": "صح/خطأ",
        "subject": "الشفافية ومكافحة الفساد",
        "text": "يجب حماية المُبلِّغين عن وقائع الفساد.",
        "options": null,
        "answer": "صح"
    },
    {
        "id": "COR-034",
        "type": "صح/خطأ",
        "subject": "الشفافية ومكافحة الفساد",
        "text": "لا يلزم حماية الخبراء والشهود في قضايا الفساد.",
        "options": null,
        "answer": "خطأ"
    },
    {
        "id": "COR-035",
        "type": "صح/خطأ",
        "subject": "الشفافية ومكافحة الفساد",
        "text": "لا يجوز التحفظ والحجز على العائدات الإجرامية للفساد.",
        "options": null,
        "answer": "خطأ"
    },
    {
        "id": "COR-036",
        "type": "صح/خطأ",
        "subject": "الشفافية ومكافحة الفساد",
        "text": "يجب منع غسل الأموال الملوثة بالفساد.",
        "options": null,
        "answer": "صح"
    },
    {
        "id": "COR-037",
        "type": "صح/خطأ",
        "subject": "الشفافية ومكافحة الفساد",
        "text": "يتطلب التعويض عن أضرار الفساد وضع قواعد قانونية ملائمة.",
        "options": null,
        "answer": "صح"
    },
    {
        "id": "COR-038",
        "type": "صح/خطأ",
        "subject": "الشفافية ومكافحة الفساد",
        "text": "يعتبر التعويض من وسائل الحماية المدنية الموضوعية المهمة للمضرورين من أفعال الفساد.",
        "options": null,
        "answer": "صح"
    },
    {
        "id": "COR-039",
        "type": "صح/خطأ",
        "subject": "الشفافية ومكافحة الفساد",
        "text": "يحرص المشرع على حرمان المفسدين من جني ثمار فسادهم.",
        "options": null,
        "answer": "صح"
    },
    {
        "id": "COR-040",
        "type": "صح/خطأ",
        "subject": "الشفافية ومكافحة الفساد",
        "text": "لا يتعين على الدول التعاون لاسترداد الموجودات المتحصلة من الفساد.",
        "options": null,
        "answer": "خطأ"
    },
    {
        "id": "COR-041",
        "type": "صح/خطأ",
        "subject": "الشفافية ومكافحة الفساد",
        "text": "يجوز مصادرة الموجودات المتحصلة من أفعال الفساد.",
        "options": null,
        "answer": "صح"
    },
    {
        "id": "COR-042",
        "type": "صح/خطأ",
        "subject": "الشفافية ومكافحة الفساد",
        "text": "يؤدي الفساد إلى بطلان العقود المشوبة به.",
        "options": null,
        "answer": "صح"
    },
    {
        "id": "COR-043",
        "type": "صح/خطأ",
        "subject": "الشفافية ومكافحة الفساد",
        "text": "للمحكمة أن تقضي ببطلان العقود الملوثة بالفساد من تلقاء نفسها.",
        "options": null,
        "answer": "صح"
    },
    {
        "id": "COR-044",
        "type": "صح/خطأ",
        "subject": "الشفافية ومكافحة الفساد",
        "text": "يؤدي الفساد إلى بطلان شروط التحكيم الموجودة بالعقد.",
        "options": null,
        "answer": "صح"
    },
    {
        "id": "COR-045",
        "type": "صح/خطأ",
        "subject": "الشفافية ومكافحة الفساد",
        "text": "وضعت منظمة الشفافية الدولية ميثاقًا للنزاهة.",
        "options": null,
        "answer": "صح"
    },
    {
        "id": "COR-046",
        "type": "صح/خطأ",
        "subject": "الشفافية ومكافحة الفساد",
        "text": "لا يلزم مكافحة الفساد عند إبرام العقود.",
        "options": null,
        "answer": "خطأ"
    },
    {
        "id": "COR-047",
        "type": "صح/خطأ",
        "subject": "الشفافية ومكافحة الفساد",
        "text": "يجب تشديد الجزاء الجنائي والمدني وتنظيم المسئولية عن كافة صور الفساد الضار بالمجتمع.",
        "options": null,
        "answer": "صح"
    },
    {
        "id": "COR-048",
        "type": "صح/خطأ",
        "subject": "الشفافية ومكافحة الفساد",
        "text": "يجب تعزيز التعاون الدولي قضائيًا وإجرائيًا في مجال المسئولية المدنية عن الفساد.",
        "options": null,
        "answer": "صح"
    },
    {
        "id": "COR-049",
        "type": "صح/خطأ",
        "subject": "الشفافية ومكافحة الفساد",
        "text": "لا يلزم مكافحة الجرائم المعلوماتية بشأن الفساد.",
        "options": null,
        "answer": "خطأ"
    },
    {
        "id": "COR-050",
        "type": "صح/خطأ",
        "subject": "الشفافية ومكافحة الفساد",
        "text": "يجب الأخذ بنظام المصادرة العينية لموجودات وعائدات الفساد.",
        "options": null,
        "answer": "صح"
    }
];
