var tf4_data = [
    {
        "id": "REL-001",
        "type": "صح/خطأ",
        "subject": "التسامح الديني",
        "text": "تحقق سيادة السماحة الدينية في المجتمع الاستقرار والسلام الاجتماعي.",
        "options": null,
        "answer": "صح"
    },
    {
        "id": "REL-002",
        "type": "صح/خطأ",
        "subject": "التسامح الديني",
        "text": "السماحة الدينية تتطلب تفاعل سلبي بين أتباع الديانات المختلفة.",
        "options": null,
        "answer": "خطأ"
    },
    {
        "id": "REL-003",
        "type": "صح/خطأ",
        "subject": "التسامح الديني",
        "text": "يعبر خلق التسامح عن الحرية في الاختيار.",
        "options": null,
        "answer": "صح"
    },
    {
        "id": "REL-004",
        "type": "صح/خطأ",
        "subject": "التسامح الديني",
        "text": "استطاعت المجتمعات الأوروبية بناء حضارتها الحديثة دون الحاجة لنشر ثقافة التسامح بين الأديان.",
        "options": null,
        "answer": "خطأ"
    },
    {
        "id": "REL-005",
        "type": "صح/خطأ",
        "subject": "التسامح الديني",
        "text": "اشتركت الديانات الكبرى في تاريخ الإنسانية (اليهودية والمسيحية والإسلام) في الدعوة إلى التآخي والتضامن بين البشر.",
        "options": null,
        "answer": "صح"
    },
    {
        "id": "REL-006",
        "type": "صح/خطأ",
        "subject": "التسامح الديني",
        "text": "تعبر القيم السائدة في المجتمع عن خصوصية ثقافته.",
        "options": null,
        "answer": "صح"
    },
    {
        "id": "REL-007",
        "type": "صح/خطأ",
        "subject": "التسامح الديني",
        "text": "لا توجد علاقة بين تقدم المجتمع اقتصادياً ودرجة السلام الاجتماعي التي وصل إليها.",
        "options": null,
        "answer": "خطأ"
    },
    {
        "id": "REL-008",
        "type": "صح/خطأ",
        "subject": "التسامح الديني",
        "text": "كان احترام الأديان الأخرى خلقاً منبوذاً في الحضارة المصرية القديمة.",
        "options": null,
        "answer": "خطأ"
    },
    {
        "id": "REL-009",
        "type": "صح/خطأ",
        "subject": "التسامح الديني",
        "text": "سيادة التسامح تبرز الشخصية الفردية.",
        "options": null,
        "answer": "صح"
    },
    {
        "id": "REL-010",
        "type": "صح/خطأ",
        "subject": "التسامح الديني",
        "text": "من الممكن سيادة السلام الاجتماعي داخل المجتمع رغم وجود تعصب بين أتباع الأديان المختلفة.",
        "options": null,
        "answer": "خطأ"
    },
    {
        "id": "REL-011",
        "type": "صح/خطأ",
        "subject": "التسامح الديني",
        "text": "سيادة التسامح الديني في المجتمع تؤكد سيادة قيم الحرية والمساواة بين أفراده.",
        "options": null,
        "answer": "صح"
    },
    {
        "id": "REL-012",
        "type": "صح/خطأ",
        "subject": "التسامح الديني",
        "text": "كان الفيلسوف الإنجليزي جون لوك من الداعمين للمناخ الطائفي والاضطهاد لكل من يخالف آراء الكنيسة.",
        "options": null,
        "answer": "خطأ"
    },
    {
        "id": "REL-013",
        "type": "صح/خطأ",
        "subject": "التسامح الديني",
        "text": "تقوم فكرة التسامح الديني على أساس محدودية العقل البشري وعدم قدرة أي إنسان على إدراك كل جوانب الحقيقة.",
        "options": null,
        "answer": "صح"
    },
    {
        "id": "REL-014",
        "type": "صح/خطأ",
        "subject": "التسامح الديني",
        "text": "كانت قضية السماحة الدينية أول قضية تطرق سمع المسيح عليه السلام.",
        "options": null,
        "answer": "صح"
    },
    {
        "id": "REL-015",
        "type": "صح/خطأ",
        "subject": "التسامح الديني",
        "text": "لم تمنح الأديان كافة الحق لأحد في أن يحكم على مدى سلامة أو صدق المتدين.",
        "options": null,
        "answer": "خطأ"
    },
    {
        "id": "REL-016",
        "type": "صح/خطأ",
        "subject": "التسامح الديني",
        "text": "التدين هو سلوك شخصي في ممارسة الديانة.",
        "options": null,
        "answer": "صح"
    },
    {
        "id": "REL-017",
        "type": "صح/خطأ",
        "subject": "التسامح الديني",
        "text": "يمكن فهم العلاقة بين الدين والتدين دون الحاجة لإضافة عنصر ثالث لهذه العلاقة.",
        "options": null,
        "answer": "خطأ"
    },
    {
        "id": "REL-018",
        "type": "صح/خطأ",
        "subject": "التسامح الديني",
        "text": "تشير عبارة المسيح عليه السلام: \"من كان منكم بلا خطيئة فليلقها بحجر\" إلى أن التسامح يقتضي محاسبة النفس قبل الغير.",
        "options": null,
        "answer": "صح"
    },
    {
        "id": "REL-019",
        "type": "صح/خطأ",
        "subject": "التسامح الديني",
        "text": "تمثل عبارة الرسول صلى الله عليه وسلم: \"أفلا شققت عن قلبه\" عن ضرورة عدم التعرض للغير، وضرورة حمل الظاهر من الأفعال أو الأقوال على أفضل الوجوه.",
        "options": null,
        "answer": "صح"
    },
    {
        "id": "REL-020",
        "type": "صح/خطأ",
        "subject": "التسامح الديني",
        "text": "أنشئ الجامع الأزهر في العصر الفاطمي لنشر المذهب السني واستمر كذلك بعد انتهاء حكم الفاطميين.",
        "options": null,
        "answer": "خطأ"
    },
    {
        "id": "REL-021",
        "type": "صح/خطأ",
        "subject": "التسامح الديني",
        "text": "يؤدي التعصب إلى الفوضى ويمنع كل سبيل من سبل التنمية.",
        "options": null,
        "answer": "صح"
    },
    {
        "id": "REL-022",
        "type": "صح/خطأ",
        "subject": "التسامح الديني",
        "text": "تعتمد حروب الجيل الرابع على الأسلحة المتطورة تكنولوجياً والاستخدام المميز للجيوش النظامية.",
        "options": null,
        "answer": "خطأ"
    },
    {
        "id": "REL-023",
        "type": "صح/خطأ",
        "subject": "التسامح الديني",
        "text": "استطاع المصريون بفضل تماسكهم ووحدتهم ونبذهم للتعصب الديني مواجهة خطر الجماعات الإرهابية.",
        "options": null,
        "answer": "صح"
    },
    {
        "id": "REL-024",
        "type": "صح/خطأ",
        "subject": "التسامح الديني",
        "text": "السماحة الدينية هي: قبول الآخر واحترام أفكاره ومعتقداته والتعامل معه بكل تسامح ولين ويسر في كل أمور الحياة.",
        "options": null,
        "answer": "صح"
    },
    {
        "id": "REL-025",
        "type": "صح/خطأ",
        "subject": "التسامح الديني",
        "text": "لا سبيل للتنمية التي تحقق الخير للمجتمع إلا إذا ساد احترام الآخر.",
        "options": null,
        "answer": "صح"
    },
    {
        "id": "REL-026",
        "type": "صح/خطأ",
        "subject": "التسامح الديني",
        "text": "يعد سلوك التسامح من أهم القوانين التي اعتمد عليها الإسلام في نشر رسالته.",
        "options": null,
        "answer": "صح"
    },
    {
        "id": "REL-027",
        "type": "صح/خطأ",
        "subject": "التسامح الديني",
        "text": "دعا الإسلام إلى التعامل الحسن والتسامح بين المسلمين فحسب.",
        "options": null,
        "answer": "خطأ"
    },
    {
        "id": "REL-028",
        "type": "صح/خطأ",
        "subject": "التسامح الديني",
        "text": "من أهم الفضائل التي دعت إليها المسيحية هي فضيلة التسامح.",
        "options": null,
        "answer": "صح"
    },
    {
        "id": "REL-029",
        "type": "صح/خطأ",
        "subject": "التسامح الديني",
        "text": "انتهاج منهج التسامح يعد خيار الشعوب مصيراً.",
        "options": null,
        "answer": "صح"
    },
    {
        "id": "REL-030",
        "type": "صح/خطأ",
        "subject": "التسامح الديني",
        "text": "الصفح والتسامح من صفات الله سبحانه وتعالى التي دعانا للتمسك بها.",
        "options": null,
        "answer": "صح"
    },
    {
        "id": "REL-031",
        "type": "صح/خطأ",
        "subject": "التسامح الديني",
        "text": "من أهم وصايا اليهودية الدعوة للتسامح والإنصاف والإحسان.",
        "options": null,
        "answer": "صح"
    },
    {
        "id": "REL-032",
        "type": "صح/خطأ",
        "subject": "التسامح الديني",
        "text": "من الممكن القيام بحوار فعال دون شرط العلم والمعرفة.",
        "options": null,
        "answer": "خطأ"
    },
    {
        "id": "REL-033",
        "type": "صح/خطأ",
        "subject": "التسامح الديني",
        "text": "يعد الاختلاف في العقيدة من مبررات العداء في الديانات السماوية.",
        "options": null,
        "answer": "خطأ"
    },
    {
        "id": "REL-034",
        "type": "صح/خطأ",
        "subject": "التسامح الديني",
        "text": "يُعتبر الحوار هو الأسلوب الأمثل للتواصل والتفاهم والتخاطب بين الناس.",
        "options": null,
        "answer": "صح"
    },
    {
        "id": "REL-035",
        "type": "صح/خطأ",
        "subject": "التسامح الديني",
        "text": "التواضع واللين والرفق من الصفات المطلوبة في المحاور الجيد.",
        "options": null,
        "answer": "صح"
    },
    {
        "id": "REL-036",
        "type": "صح/خطأ",
        "subject": "التسامح الديني",
        "text": "من شروط الحوار الجيد بعده عن أسلوب الطعن والتجريح.",
        "options": null,
        "answer": "صح"
    },
    {
        "id": "REL-037",
        "type": "صح/خطأ",
        "subject": "التسامح الديني",
        "text": "تعد صفات التعصب وعدم قبول الحق من صفات الحوار الجيد.",
        "options": null,
        "answer": "خطأ"
    },
    {
        "id": "REL-038",
        "type": "صح/خطأ",
        "subject": "التسامح الديني",
        "text": "لا يشترط في آداب الحوار أن يكون المتحاورون منصفين.",
        "options": null,
        "answer": "خطأ"
    },
    {
        "id": "REL-039",
        "type": "صح/خطأ",
        "subject": "التسامح الديني",
        "text": "نشر سماحة الأديان يؤدي إلى اندثار الفتن وعموم السلام.",
        "options": null,
        "answer": "صح"
    },
    {
        "id": "REL-040",
        "type": "صح/خطأ",
        "subject": "التسامح الديني",
        "text": "من الآداب الواجب توافرها في الحوار هو حسن القصد منه.",
        "options": null,
        "answer": "صح"
    },
    {
        "id": "REL-041",
        "type": "صح/خطأ",
        "subject": "التسامح الديني",
        "text": "لم تحرص الأديان السماوية على التعايش وقبول الآخر.",
        "options": null,
        "answer": "خطأ"
    },
    {
        "id": "REL-042",
        "type": "صح/خطأ",
        "subject": "التسامح الديني",
        "text": "نشر سماحة الأديان سيؤدي إلى نشر آداب الحوار بين البشر.",
        "options": null,
        "answer": "صح"
    },
    {
        "id": "REL-043",
        "type": "صح/خطأ",
        "subject": "التسامح الديني",
        "text": "أكد الإسلام على ضرورة محاورة أهل الكتاب بلغة الإنصاف والعدل.",
        "options": null,
        "answer": "صح"
    },
    {
        "id": "REL-044",
        "type": "صح/خطأ",
        "subject": "التسامح الديني",
        "text": "من الممكن أن ينجح الحوار بين الأديان دون التمسك بخلق التسامح بين المتحاورين.",
        "options": null,
        "answer": "خطأ"
    },
    {
        "id": "REL-045",
        "type": "صح/خطأ",
        "subject": "التسامح الديني",
        "text": "إبداء الإعجاب من قبل المحاور بالأفكار الصحيحة والأدلة الجيدة التي يوردها محاوره يضفي روح الموضوعية على الحوار.",
        "options": null,
        "answer": "صح"
    },
    {
        "id": "REL-046",
        "type": "صح/خطأ",
        "subject": "التسامح الديني",
        "text": "من أهم المميزات التي يتميز بها الدين الإسلامي هي السماحة واليسر.",
        "options": null,
        "answer": "صح"
    },
    {
        "id": "REL-047",
        "type": "صح/خطأ",
        "subject": "التسامح الديني",
        "text": "دعت اليهودية إلى التجاوز عن أخطاء المخطئين والإحسان إلى المسيئين.",
        "options": null,
        "answer": "صح"
    },
    {
        "id": "REL-048",
        "type": "صح/خطأ",
        "subject": "التسامح الديني",
        "text": "تتركز أهمية الحوار في أنه هو الطريق الوحيد في اقناع المخالف بالفكرة الصحيحة وصولاً إلى الحق",
        "options": null,
        "answer": "صح"
    },
    {
        "id": "REL-049",
        "type": "صح/خطأ",
        "subject": "التسامح الديني",
        "text": "عُرف النبي عيسى عليه السلام بصفتي العفو والصفح عن كل من أساء إليه.",
        "options": null,
        "answer": "صح"
    },
    {
        "id": "REL-050",
        "type": "صح/خطأ",
        "subject": "التسامح الديني",
        "text": "دعوة الإسلام للتسامح دعوة عالمية للناس أجمعين.",
        "options": null,
        "answer": "صح"
    }
];
